freesbeeGE/test/dati/e/test7Esterno.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:ge="http://ge.freesbee.unibas.it/">
    <SOAP-ENV:Body>
        <ge:pubblicaMessaggio>
            <messaggioSoap>
                <ricercaPubblicatori>
                    <pubblicatore>
                        <nomePubblicatore>Q</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <categoriaSottoscrizione>Test8</categoriaSottoscrizione>
                </ricercaPubblicatori>
            </messaggioSoap>
            <nomePubblicatore>NICA_PUGLIA</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:pubblicaMessaggio>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>